Revit 2026 API

# BuiltInFailuresAlignmentFailures Class

---

Failures related to alignment elements and annotations.

SystemObject Autodesk.Revit.DBBuiltInFailuresAlignmentFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class AlignmentFailures
```
```vb
Public NotInheritable Class AlignmentFailures
```
```cpp
public ref class AlignmentFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AlignmentFailures = class end
```

The BuiltInFailuresAlignmentFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignmentCheckStationLabels | A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels. Please check the labels to ensure proper placement. |

#### Reference

Autodesk.Revit.DB Namespace